repuslive-ball-overset/case/twodisks/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    overset1
    {
        type            overset;
        inGroups        1(overset);
        nFaces          80;
        startFace       25630;
    }
    overset2
    {
        type            overset;
        inGroups        1(overset);
        nFaces          80;
        startFace       25710;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          280;
        startFace       25790;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          70;
        startFace       26070;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          70;
        startFace       26140;
    }
    hole
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       26210;
    }
    hole1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       26290;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          19600;
        startFace       26370;
    }
    frontAndBack1
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3200;
        startFace       45970;
    }
    frontAndBack2
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3200;
        startFace       49170;
    }
)

// ************************************************************************* //
